snlkuharlocal/src/InformationRegisters/ЗначенияСвойствОбъектов/ЗначенияСвойствОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСвойствОбъектов</name>
  <comment>(Общ)</comment>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Свойство</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/ChartsOfCharacteristicTypes/СвойстваОбъектов/СвойстваОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СвойстваОбъектов</name>
  <comment>(Общ)</comment>
  <type>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.ТипыКоробов</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.ФР_Коллекции</types>
    <types>CatalogRef.Кассы</types>
    <types>CatalogRef.РайоныДоставки</types>
    <types>CatalogRef.КлассификаторСтранМира</types>
    <types>CatalogRef.Коллекции</types>
    <types>CatalogRef.ФР_ПоловозрастныеПризнаки</types>
    <types>CatalogRef.СтатьиЗатрат</types>
    <types>CatalogRef.ФР_ВидыНоменклатуры</types>
    <types>CatalogRef.ОтсрочкиПлатежа</types>
    <types>EnumRef.ПериодичностьОтчетов</types>
    <types>CatalogRef.ТипыЦен</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>Boolean</types>
    <types>CatalogRef.ТипыСкидок</types>
    <types>CatalogRef.Цвета</types>
    <types>CatalogRef.Размеры</types>
    <types>CatalogRef.Автомобили</types>
    <types>String</types>
    <types>EnumRef.СостояниеДокументов</types>
    <types>CatalogRef.Регионы</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Подразделения</types>
    <types>CatalogRef.ПричиныРекламаций</types>
    <types>Date</types>
    <types>CatalogRef.ФР_Бренды</types>
    <types>Number</types>
    <types>EnumRef.ПланФакт</types>
    <types>EnumRef.СостоянияОтчетов</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ФР_НоменклатурныеГруппы</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.АналитикаОтчетов</types>
    <types>CatalogRef.ИБ</types>
    <types>CatalogRef.ВидыОтчетов</types>
    <numberQualifiers>
      <precision>19</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>250</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВидПланаПродаж</name>
      <description>Вид плана продаж</description>
      <code>00109</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ВидРаспределения</name>
      <description>Вид распределения</description>
      <code>00111</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ВидРаспределения2</name>
      <description>Вид распределения 2</description>
      <code>00217</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ДатаПоследнейСверки</name>
      <description>Дата последней сверки</description>
      <code>00215</code>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </items>
    <items>
      <name>КонтрольЛимитаЗадолженности</name>
      <description>Контроль лимита задолженности</description>
      <code>00216</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>КонтрольПросроченнойЗадолженности</name>
      <description>Контроль просроченной задолженности</description>
      <code>00112</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>Контрагент</name>
      <description>Основной поставщик</description>
      <code>00110</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>СостояниеДокументов</name>
      <description>Состояние документов</description>
      <code>00214</code>
      <type>
        <types>EnumRef.СостояниеДокументов</types>
      </type>
    </items>
    <items>
      <name>ТоварнаяГруппа</name>
      <description>Товарная группа</description>
      <code>00213</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>НазначениеСвойства</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.НазначенияСвойствКатегорийОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ЧЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

snlkuharlocal/src/CommonModules/ФР_ДопРеквизиты_С/Module.bsl
Процедура ПриСозданииНаСервере(ОбъектСсылка, ЭтаФорма) Экспорт
	
	ТипОбъекта = ТипЗнч(ОбъектСсылка);
	ВыборкаНазначенияСвойств = ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Выбрать();
	Пока ВыборкаНазначенияСвойств.Следующий() Цикл
		Если ВыборкаНазначенияСвойств.ТипЗначения.СодержитТип(ТипОбъекта) Тогда
			НазначениеСвойства = ВыборкаНазначенияСвойств.Ссылка;
		КонецЕсли;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СвойстваОбъектов.Ссылка 			КАК Ссылка,
	|	СвойстваОбъектов.Наименование	 	КАК Наименование,
	|	СвойстваОбъектов.ТипЗначения 		КАК ТипЗначения,
	|	ЗначенияСвойствОбъектов.Значение 	КАК Значение
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
	|ЛЕВОЕ СОЕДИНЕНИЕ 
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ПО 
	|	СвойстваОбъектов.Ссылка = ЗначенияСвойствОбъектов.Свойство
	|	И (ЗначенияСвойствОбъектов.Объект = &ОбъектСсылка)
	|ГДЕ
	|	СвойстваОбъектов.НазначениеСвойства = &НазначениеСвойства
	|	И НЕ СвойстваОбъектов.ПометкаУдаления
	|	И СвойстваОбъектов.Наименование ПОДОБНО ""%(ФР)""
	|";
	
	Запрос.УстановитьПараметр("НазначениеСвойства", НазначениеСвойства);
	Запрос.УстановитьПараметр("ОбъектСсылка",		ОбъектСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДобавляемыеРеквизиты	= Новый Массив;
	ЗначенияРеквизитов		= Новый Структура;
	
	Пока Выборка.Следующий() Цикл
		
		ИмяРеквизита = "ДополнительныйРеквизит_" + СтрЗаменить(Строка(Выборка.Ссылка.УникальныйИдентификатор()), "-", "_");
		РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита, Выборка.ТипЗначения,, Выборка.Наименование);
		
		ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
		
		ЗначенияРеквизитов.Вставить(ИмяРеквизита, Выборка.Значение);
		
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для Каждого ДополнительныйРеквизит Из ДобавляемыеРеквизиты Цикл
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить(ДополнительныйРеквизит.Имя, Тип("ПолеФормы"), ЭтаФорма.Элементы.ГруппаДополнительныеРеквизиты);
		НовыйЭлемент.ПутьКДанным			= ДополнительныйРеквизит.Имя;
		НовыйЭлемент.Вид					= ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.АвтоМаксимальнаяШирина	= Ложь;
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ЗначенияРеквизитов);
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(ОбъектСсылка, ЭтаФорма) Экспорт
	
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ОбъектСсылка);
	
	Для Каждого РеквизитФормы Из ЭтаФорма.ПолучитьРеквизиты() Цикл
		Если СтрНайти(РеквизитФормы.Имя, "ДополнительныйРеквизит_") > 0 Тогда
			
			СвойствоГУИДСтрока = СтрЗаменить(РеквизитФормы.Имя, "ДополнительныйРеквизит_", "");
			СвойствоГУИДСтрока = СтрЗаменить(СвойствоГУИДСтрока, "_", "-");
			СвойствоГУИД = Новый УникальныйИдентификатор(СвойствоГУИДСтрока);
			
			Свойство = ПланыВидовХарактеристик.СвойстваОбъектов.ПолучитьСсылку(СвойствоГУИД);
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Объект		= ОбъектСсылка;
			НоваяЗапись.Свойство	= Свойство;
			НоваяЗапись.Значение	= ЭтаФорма[РеквизитФормы.Имя];
			
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры
